{
    "mock_data": "Overminds mission is to enable more developers to enter web3, build ground-breaking products, and access rare opportunities. We believe that one of the biggest drags on crypto's growth is the friction and uncertainty that developers face in the transition from web2 to web3. Overmind makes it easy for all people, regardless of what coding experience they have, to continue to learn, earn and grow through a series of quests, and find their next role in web3. As our Full Stack Engineer, you will join our Product & Engineering team focusing on making learning web3 fun, practical and accessible for all. To achieve this goal, one of our team's core beliefs is that we need to ship features fast, reliably and with low friction. At the forefront of how we design and implement new features to our core platform, you will be excited about how we impact our users by contributing across the entire stack.Overmind is written in Next.js and we code heavily in TypeScript coupled with the T3 Stack. We currently implement smart contracts supporting Overmind in Move and will leverage other smart contract programming languages as we integrate with other chains. Although we are currently using this stack, we care deeply about a growth mindset and intellectual curiosity coupled with a drive to build world-changing products. This is a hybrid role. The ideal candidate will live in the Columbus area and be able to travel into the office for up to 3 days per week. You Will Design and implement new features end-to-end across our entire stack on our core platform Contribute to data-led discussions which influence which problems we solve next and how we solve them Continue to grow your engineering skills and help others on the team by participating in design and code reviews Work with Product and Growth partners to launch end-user features which you help build You Have 3+ years of TypeScript experience 2+ years of React.js or Node.js experience A natural curiosity continue learning and developing new skills An ability to work effectively in a globally distributed team You May Have    Experience with Next.js Experience building serverless backends Experience working with blockchain technologies including Move and Solidity "
  }